ГТС/УТГТС/Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Comment>Используется для группировки по территориальному признаку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиенты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Comment>Конкуренты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<Comment>Обслуживаются торговыми представителями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сег_Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сег_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Comment>Перевозчики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлассаКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыКлассаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецценаUSD</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйВидЦены</Name>
					<Comment>Уточняющий или индивидуальный вид цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/Партнеры/Forms/ВводНаОснованииСделки/Ext/Form/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
	// Проверка заполнения
	Если НЕ ПроверитьЗаполнение() Тогда
		Предупреждение("Заполните необходимые реквизиты!!!");
		Возврат;
	ИначеЕсли ПустаяСтрока(ЕМайл) И ПустаяСтрока(Телефон) Тогда
		Предупреждение("Заполните хотя бы одно поле контактной информации партнера (телефон или e-mail)");
		Возврат;
	КонецЕсли;	
	
	// Проверка подобных реквизитов
	Если ЕстьПодобноеНаименование ИЛИ ЕстьПодобныйEmail ИЛИ ЕстьПодобныйТелефон Тогда
		Ответ = Вопрос("Обнаружены партнеры с подобными реквизитами (наименование, e-mail или телефон). Продолжить создание партнера?", РежимДиалогаВопрос.ДаНетОтмена);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	// При создании контактного лица проверяем по физ. лицу
	Если СоздатьКонтактноеЛицо Тогда
		Если ИспользованиеФизЛица = 0
			И НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
			Предупреждение("Для создания контактного лица требуется указать физ.лицо");
			Возврат;
		ИначеЕсли ИспользованиеФизЛица = 1 
			И ПустаяСтрока(Фамилия+Имя+Отчество) Тогда
			Предупреждение("Для создания контактного лица укажите ФИО физ.лица");
			Возврат;
		КонецЕсли;
		//
		Если ПустаяСтрока(ЕмайлКонтактногоЛица) 
			И ПустаяСтрока(ТелефонКонтактногоЛица)
			И ПустаяСтрока(МобильныйТелефон) Тогда
			Предупреждение("Заполните хотя бы одно поле контактной информации контактного лица");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
		
	// Создание партнера
	Партнер = СозданиеПартнера();
	
	Структура = Новый Структура("Партнер, КаналПервичногоИнтереса, ИсточникПервичногоИнтереса", Партнер, КаналПервичногоИнтереса, ИсточникПервичногоИнтереса);
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("БизнесРегион", БизнесРегион);
	Параметры.Свойство("КаналПервичногоИнтереса", КаналПервичногоИнтереса);
	Параметры.Свойство("ИсточникПервичногоИнтереса", ИсточникПервичногоИнтереса);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтактноеЛицоПриИзменении(Элемент)
	Если СоздатьКонтактноеЛицо Тогда
		Элементы.КонтактноеЛицо.Доступность = Истина;
	Иначе
		Элементы.КонтактноеЛицо.Доступность = Ложь;	
		Имя = Неопределено;
		Отчество = Неопределено;
		Фамилия = Неопределено;
		ЕмайлКонтактногоЛица = Неопределено;
		ТелефонКонтактногоЛица = Неопределено;
		МобильныйТелефон = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)		
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводТелефона");
	Телефон = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводТелефона");
	МобильныйТелефон = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура ТелефонКонтактногоЛицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводТелефона");
	Телефон = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеФизЛицаПриИзменении(Элемент)
	Элементы.ФизЛицо.Видимость = (ИспользованиеФизЛица = 0);
КонецПроцедуры

&НаСервере
Функция СозданиеПартнера()
	Нов = Справочники.Партнеры.СоздатьЭлемент();
	Нов.Родитель = ГруппаПартнеров;
	Нов.Наименование = Наименование;
	Нов.НаименованиеПолное = Наименование;
	Нов.БизнесРегион = БизнесРегион;
	Нов.ДатаРегистрации = ТекущаяДата();
	Нов.Клиент = Истина;
	Нов.ОсновнойМенеджер = ПараметрыСеанса.ТекущийПользователь;
	Нов.Комментарий = Комментарий;
	
	// Контактная информация
	Если НЕ ПустаяСтрока(ЕМайл) Тогда
		СтрокаТЧ = Нов.КонтактнаяИнформация.Добавить();
		СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
		СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтрокаТЧ.АдресЭП = ЕМайл;
		СтрокаТЧ.Представление = ЕМайл;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Телефон) Тогда
		СтрокаТЧ = Нов.КонтактнаяИнформация.Добавить();
		СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
		СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтрокаТЧ.НомерТелефона = Телефон;
		СтрокаТЧ.Представление = Телефон;
	КонецЕсли;
	
	Нов.Записать();
	
	// Контактное лицо
	Если СоздатьКонтактноеЛицо Тогда
		// Определимся с физ.лицом КЛ
		Если ИспользованиеФизЛица = 1 Тогда//Создаем физ.лицо
			НовФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовФЛ.Родитель = ГруппаФизЛиц;
			НовФЛ.Наименование = Фамилия + " " + Имя + " " + Отчество;
			НовФЛ.Записать();
			ФизЛицо = НовФЛ.Ссылка;
		КонецЕсли;
		
		НовКЛ = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
		НовКЛ.Владелец = Нов.Ссылка;
		НовКЛ.ФизЛицо = ФизЛицо;
		НовКЛ.Наименование = ФизЛицо.Наименование;
		НовКЛ.ДатаРегистрацииСвязи = ТекущаяДата();
		НовКЛ.РолиКонтактногоЛица.Добавить().РольКонтактногоЛица = РольКонтактногоЛица;
		НовКЛ.Автор = ПараметрыСеанса.ТекущийПользователь;
		
		// Контактные данные контактного лица
		Если НЕ ПустаяСтрока(ЕмайлКонтактногоЛица) Тогда
			СтрокаТЧ = НовКЛ.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтрокаТЧ.АдресЭП = ЕмайлКонтактногоЛица;
			СтрокаТЧ.Представление = ЕмайлКонтактногоЛица;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТелефонКонтактногоЛица) Тогда
			СтрокаТЧ = НовКЛ.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрокаТЧ.НомерТелефона = ТелефонКонтактногоЛица;
			СтрокаТЧ.Представление = ТелефонКонтактногоЛица;
		КонецЕсли;
		Если НЕ ПустаяСтрока(МобильныйТелефон) Тогда
			СтрокаТЧ = НовКЛ.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрокаТЧ.НомерТелефона = МобильныйТелефон;
			СтрокаТЧ.Представление = МобильныйТелефон;
		КонецЕсли;
		
		НовКЛ.Записать();
	КонецЕсли;
	
	Возврат Нов.Ссылка;
	
КонецФункции	

&НаКлиенте
Процедура НаименованиеПолноеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений();
	Список.Добавить("ООО """+Наименование+"""");
	Список.Добавить("ОАО """+Наименование+"""");
	Список.Добавить("ЗАО """+Наименование+"""");
	Список.Добавить("ГУП """+Наименование+"""");
	
	Выбор = ВыбратьИзСписка(Список);
	Если Выбор = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НаименованиеПолное = Выбор.Значение;
КонецПроцедуры

//// Проверка наличия партнеров с подобными характеристиками
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПроверитьНаименованиеНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ЕМайлПриИзменении(Элемент)
	ПроверитьЕМайлНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	ПроверитьТелефонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаименованиеНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Партнеры.Ссылка) КАК КоличествоПодобныхПартнеров
	                      |ИЗ
	                      |	Справочник.Партнеры КАК Партнеры
	                      |ГДЕ
	                      |	Партнеры.Наименование ПОДОБНО &Наименование");
	Запрос.УстановитьПараметр("Наименование", "%"+Наименование+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоПодобныхПартнеров > 0 Тогда
		ЕстьПодобноеНаименование = Истина;
	Иначе
		ЕстьПодобноеНаименование = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЕМайлНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПартнерыКонтактнаяИнформация.Ссылка) КАК КоличествоПодобныхПартнеров
	                      |ИЗ
	                      |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	                      |ГДЕ
	                      |	ПартнерыКонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП");
	Запрос.УстановитьПараметр("АдресЭП", "%"+ЕМайл+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоПодобныхПартнеров > 0 Тогда
		ЕстьПодобныйEmail = Истина;
	Иначе
		ЕстьПодобныйEmail = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьТелефонНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПартнерыКонтактнаяИнформация.Ссылка) КАК КоличествоПодобныхПартнеров
	                      |ИЗ
	                      |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	                      |ГДЕ
	                      |	(ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО &Телефон
	                      |			ИЛИ ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов ПОДОБНО &Телефон)");
	Запрос.УстановитьПараметр("Телефон", "%"+Телефон+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоПодобныхПартнеров > 0 Тогда
		ЕстьПодобныйТелефон = Истина;
	Иначе
		ЕстьПодобныйТелефон = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЮрЛицоПриИзменении(Элемент)
	Если ЮрЛицо=Истина Тогда
	СоздатьКонтактноеЛицо=Истина;
Если СоздатьКонтактноеЛицо Тогда
		Элементы.КонтактноеЛицо.Доступность = Истина;
	Иначе
		Элементы.КонтактноеЛицо.Доступность = Ложь;	
		Имя = Неопределено;
		Отчество = Неопределено;
		Фамилия = Неопределено;
		ЕмайлКонтактногоЛица = Неопределено;
		ТелефонКонтактногоЛица = Неопределено;
		МобильныйТелефон = Неопределено;
	КонецЕсли;	
	
	КонецЕсли;

КонецПроцедуры
